echostreams/nucemu/include/hw/i2c/nuc980_i2c.h
#define I2C_BUSTCTL_CLKTOIEN_Pos         (3)                                               /*!< I2C_T::BUSTCTL: CLKTOIEN Position      */
#define I2C_BUSTCTL_CLKTOIEN_Msk         (0x1ul << I2C_BUSTCTL_CLKTOIEN_Pos)               /*!< I2C_T::BUSTCTL: CLKTOIEN Mask          */

#define I2C_BUSTCTL_TORSTEN_Pos          (4)                                               /*!< I2C_T::BUSTCTL: TORSTEN Position       */
#define I2C_BUSTCTL_TORSTEN_Msk          (0x1ul << I2C_BUSTCTL_TORSTEN_Pos)                /*!< I2C_T::BUSTCTL: TORSTEN Mask           */

#define I2C_BUSSTS_BUSY_Pos              (0)                                               /*!< I2C_T::BUSSTS: BUSY Position           */
#define I2C_BUSSTS_BUSY_Msk              (0x1ul << I2C_BUSSTS_BUSY_Pos)                    /*!< I2C_T::BUSSTS: BUSY Mask               */

#define I2C_BUSSTS_BCDONE_Pos            (1)                                               /*!< I2C_T::BUSSTS: BCDONE Position         */
#define I2C_BUSSTS_BCDONE_Msk            (0x1ul << I2C_BUSSTS_BCDONE_Pos)                  /*!< I2C_T::BUSSTS: BCDONE Mask             */

#define I2C_BUSSTS_PECERR_Pos            (2)                                               /*!< I2C_T::BUSSTS: PECERR Position         */
#define I2C_BUSSTS_PECERR_Msk            (0x1ul << I2C_BUSSTS_PECERR_Pos)                  /*!< I2C_T::BUSSTS: PECERR Mask             */

#define I2C_BUSSTS_ALERT_Pos             (3)                                               /*!< I2C_T::BUSSTS: ALERT Position          */
#define I2C_BUSSTS_ALERT_Msk             (0x1ul << I2C_BUSSTS_ALERT_Pos)                   /*!< I2C_T::BUSSTS: ALERT Mask              */

#define I2C_BUSSTS_SCTLDIN_Pos           (4)                                               /*!< I2C_T::BUSSTS: SCTLDIN Position        */
#define I2C_BUSSTS_SCTLDIN_Msk           (0x1ul << I2C_BUSSTS_SCTLDIN_Pos)                 /*!< I2C_T::BUSSTS: SCTLDIN Mask            */

#define I2C_BUSSTS_BUSTO_Pos             (5)                                               /*!< I2C_T::BUSSTS: BUSTO Position          */
#define I2C_BUSSTS_BUSTO_Msk             (0x1ul << I2C_BUSSTS_BUSTO_Pos)                   /*!< I2C_T::BUSSTS: BUSTO Mask              */

#define I2C_BUSSTS_CLKTO_Pos             (6)                                               /*!< I2C_T::BUSSTS: CLKTO Position          */
#define I2C_BUSSTS_CLKTO_Msk             (0x1ul << I2C_BUSSTS_CLKTO_Pos)                   /*!< I2C_T::BUSSTS: CLKTO Mask              */

#define I2C_BUSSTS_PECDONE_Pos           (7)                                               /*!< I2C_T::BUSSTS: PECDONE Position        */
#define I2C_BUSSTS_PECDONE_Msk           (0x1ul << I2C_BUSSTS_PECDONE_Pos)                 /*!< I2C_T::BUSSTS: PECDONE Mask            */

#define I2C_PKTSIZE_PLDSIZE_Pos          (0)                                               /*!< I2C_T::PKTSIZE: PLDSIZE Position       */
#define I2C_PKTSIZE_PLDSIZE_Msk          (0x1fful << I2C_PKTSIZE_PLDSIZE_Pos)              /*!< I2C_T::PKTSIZE: PLDSIZE Mask           */

#define I2C_PKTCRC_PECCRC_Pos            (0)                                               /*!< I2C_T::PKTCRC: PECCRC Position         */
#define I2C_PKTCRC_PECCRC_Msk            (0xfful << I2C_PKTCRC_PECCRC_Pos)                 /*!< I2C_T::PKTCRC: PECCRC Mask             */

#define I2C_BUSTOUT_BUSTO_Pos            (0)                                               /*!< I2C_T::BUSTOUT: BUSTO Position         */
#define I2C_BUSTOUT_BUSTO_Msk            (0xfful << I2C_BUSTOUT_BUSTO_Pos)                 /*!< I2C_T::BUSTOUT: BUSTO Mask             */

#define I2C_CLKTOUT_CLKTO_Pos            (0)                                               /*!< I2C_T::CLKTOUT: CLKTO Position         */
#define I2C_CLKTOUT_CLKTO_Msk            (0xfful << I2C_CLKTOUT_CLKTO_Pos)                 /*!< I2C_T::CLKTOUT: CLKTO Mask             */

struct NUC980I2CState {
	/*< private >*/
	SysBusDevice parent_obj;

	/*< public >*/
	MemoryRegion iomem;
	I2CBus* bus;
	qemu_irq irq;

	uint32_t CTL0;                  /*!< [0x0000] I2C Control Register 0                                           */
	uint32_t ADDR0;                 /*!< [0x0004] I2C Slave Address Register0                                      */
	uint32_t DAT;                   /*!< [0x0008] I2C Data Register                                                */
	uint32_t STATUS0;               /*!< [0x000c] I2C Status Register 0                                            */
	uint32_t CLKDIV;                /*!< [0x0010] I2C Clock Divided Register                                       */
	uint32_t TOCTL;                 /*!< [0x0014] I2C Time-out Control Register                                    */
	uint32_t ADDR1;                 /*!< [0x0018] I2C Slave Address Register1                                      */
	uint32_t ADDR2;                 /*!< [0x001c] I2C Slave Address Register2                                      */
	uint32_t ADDR3;                 /*!< [0x0020] I2C Slave Address Register3                                      */
	uint32_t ADDRMSK0;              /*!< [0x0024] I2C Slave Address Mask Register0                                 */
	uint32_t ADDRMSK1;              /*!< [0x0028] I2C Slave Address Mask Register1                                 */
	uint32_t ADDRMSK2;              /*!< [0x002c] I2C Slave Address Mask Register2                                 */
	uint32_t ADDRMSK3;              /*!< [0x0030] I2C Slave Address Mask Register3                                 */
	//uint32_t RESERVE0[2];
	uint32_t WKCTL;                 /*!< [0x003c] I2C Wake-up Control Register                                     */
	uint32_t WKSTS;                 /*!< [0x0040] I2C Wake-up Status Register                                      */
	uint32_t CTL1;                  /*!< [0x0044] I2C Control Register 1                                           */
	uint32_t STATUS1;               /*!< [0x0048] I2C Status Register 1                                            */
	uint32_t TMCTL;                 /*!< [0x004c] I2C Timing Configure Control Register                            */
	uint32_t BUSCTL;                /*!< [0x0050] I2C Bus Management Control Register                              */
	uint32_t BUSTCTL;               /*!< [0x0054] I2C Bus Management Timer Control Register                        */
	uint32_t BUSSTS;                /*!< [0x0058] I2C Bus Management Status Register                               */
	uint32_t PKTSIZE;               /*!< [0x005c] I2C Packet Error Checking Byte Number Register                   */
	uint32_t PKTCRC;                /*!< [0x0060] I2C Packet Error Checking Byte Value Register                    */
	uint32_t BUSTOUT;               /*!< [0x0064] I2C Bus Management Timer Register                                */
	uint32_t CLKTOUT;               /*!< [0x0068] I2C Bus Management Clock Low Timer Register*/

	bool is_recv;
	bool ack;
	QEMUTimer* dat_timer;
	int64_t dat_time;
};

